<blank>	0
T	1
H	2
E	3
 	4
S	5
A	6
L	7
O	8
F	9
I	10
P	11
R	12
D	13
Y	14
'	15
G	16
N	17
C	18
M	19
B	20
U	21
W	22
.	23
X	24
V	25
K	26
Q	27
J	28
Z	29
,	30
"	31
-	32
&	33
*	34
?	35
(	36
)	37
:	38
;	39
{	40
}	41
!	42
/	43
